(setf l1 '((Москва.Россия) (Лондон.Британия) (Берлин.Германия)))
(setf l1 (pairlis 
           '(Москва Лондон Берлин) '(Россия Британия Германия)))

(print (assoc 'Москва l1))     ; (МОСКВА . РОССИЯ)
(print (assoc 'Вашингтон l1))  ; NIL
(print (rassoc 'Германия l1))  ; (БЕРЛИН . ГЕРМАНИЯ)

(acons 'Минск 'Беларусь l1)

(print (sublis '((a . 1) (b . 2) (c . 3)) '(a b c))) ; (1 2 3)
(print (sublis '((a . 1) (b . 2) (c . 3)) 'a))       ; 1

; Пример замены значения по ключу
(rplacd (assoc 'Москва l1) 'МИР)
(print l1)   ; ((БЕРЛИН . ГЕРМАНИЯ) 
             ;  (ЛОНДОН . БРИТАНИЯ) (МОСКВА . МИР))